mattburlakov/ae_stm32_display_ui/include/hardware/src/hardware.cpp
#include "hardware.h"

#include "hardware_encoder.h"
#include "hardware_exti.h"
#include "hardware_gpio.h"
#include "hardware_spi.h"
#include "hardware_uart.h"

#include "hardware_ssd1322.h"

#include <stm32f10x.h>

struct Ssd1322Interface ssd1322_interface;

static void ssd1322_write( const uint8_t* buffer, size_t size ) {
     hardware_gpio_pin_reset( GPIO_PIN_DISPLAY_CHIP_SELECT );
     hardware_spi_write( buffer, size );
     hardware_gpio_pin_set( GPIO_PIN_DISPLAY_CHIP_SELECT );
}

static void ssd1322_read( uint8_t* buffer, size_t size ) {      // stub.
     __NOP();
}

static void ssd1322_reset( bool reset ) {
     if( reset )
          hardware_gpio_pin_reset( GPIO_PIN_DISPLAY_RESET );
     else
          hardware_gpio_pin_set( GPIO_PIN_DISPLAY_RESET );
}

static void ssd1322_data_command( bool data ) {
     if( data )
          hardware_gpio_pin_set( GPIO_PIN_DISPLAY_DC );
     else
          hardware_gpio_pin_reset( GPIO_PIN_DISPLAY_DC );
}

static void init_ssd1322_interface( void ) {
     ssd1322_interface.write            = ssd1322_write;
     ssd1322_interface.read             = ssd1322_read;
     ssd1322_interface.delay            = hardware_delay;
     ssd1322_interface.reset            = ssd1322_reset;
     ssd1322_interface.data_command     = ssd1322_data_command;
}

void hardware_delay( size_t delay ) {
     for ( size_t idx = 0; idx < delay; ++idx ) {
          __NOP();
     }
}

void hardware_init( void ) {
     __disable_irq();

     hardware_gpio_init();
     hardware_exti_init();
     hardware_spi_init();

     hardware_gpio_pin_set( GPIO_PIN_DISPLAY_CHIP_SELECT );

     hardware_encoder_init();

     init_ssd1322_interface();
     hardware_ssd1322_init( &ssd1322_interface );

     __enable_irq();
}

